Source/ProductSearch/examples/FindProductsByTypeRequest.xml

<!--This is an example to test the Find Products By Type Request-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getProductsRequest>
            <gs:productName></gs:productName>
            <gs:productType>ECOTOUR</gs:productType>
            <gs:supplierId></gs:supplierId>
        </gs:getProductsRequest>
    </soapenv:Body>
</soapenv:Envelope>